Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/hooks-custom_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: hooks-custom title: Building Your Own Hooks permalink: docs/hooks-custom.html next: hooks-reference.html prev: hooks-rules.html ---
ja: --- id: hooks-custom title: 独自フックの作成 permalink: docs/hooks-custom.html next: hooks-reference.html prev: hooks-rules.html ---

source: *Hooks* are a new addition in React 16.8.
ja: *フック (hook)* は React 16.8 で追加された新機能です。

source: They let you use state and other React features without writing a class.
ja: state などの React の機能を、クラスを書かずに使えるようになります。

source: Building your own Hooks lets you extract component logic into reusable functions.
ja: 自分独自のフックを作成することで、コンポーネントからロジックを抽出して再利用可能な関数を作ることが可能です。

source: When we were learning about [using the Effect Hook](/docs/hooks-effect.html#example-using-hooks-1), we saw this component from a chat application that displays a message indicating whether a friend is online or offline:
ja: 以下のコンポーネントは[副作用フックの使い方](/docs/hooks-effect.html#example-using-hooks-1)について学んだ際に見たチャットアプリのコンポーネントであり、フレンドがオンラインかオフラインかを示すメッセージを表示します。

source: Now let's say that our chat application also has a contact list, and we want to render names of online users with a green color.
ja: さて、このチャットアプリには連絡先リストもあって、そこではオンラインのユーザを緑色で表示したいとしましょう。

source: We could copy and paste similar logic above into our `FriendListItem` component but it wouldn't be ideal:
ja: 新しい `FriendListItem` コンポーネントに似たようなロジックをコピーペーストしても構いませんが、それは理想的ではないでしょう：

source: Instead, we'd like to share this logic between `FriendStatus` and `FriendListItem`.
ja: 代わりに、このロジックを `FriendStatus` と `FriendListItem` 間で共有したいと思います。

source: Traditionally in React, we've had two popular ways to share stateful logic between components:
ja: これまで React には、ステートを有するロジックをコンポーネント間で共有するための人気の手法が 2 つありました。

source: [render props](/docs/render-props.html) and [higher-order components](/docs/higher-order-components.html).
ja: [レンダープロップ](/docs/render-props.html)と[高階コンポーネント](/docs/higher-order-components.html)です。

source: We will now look at how Hooks solve many of the same problems without forcing you to add more components to the tree.
ja: ツリーに新しいコンポーネントを加える必要なしに、フックが同じ問題をどのように解決するのかを見ていきましょう。

source: ## Extracting a Custom Hook {#extracting-a-custom-hook}
ja: ## カスタムフックの抽出 {#extracting-a-custom-hook}

source: When we want to share logic between two JavaScript functions, we extract it to a third function.
ja: 2 つの JavaScript の関数間でロジックを共有したい場合、それを別の関数に抽出します。

source: Both components and Hooks are functions, so this works for them too!
ja: コンポーネントもフックも関数ですので、同じ方法が使えます！

source: **A custom Hook is a JavaScript function whose name starts with "`use`" and that may call other Hooks.
ja: **カスタムフックとは、名前が "`use`" で始まり、ほかのフックを呼び出せる JavaScript の関数のことです。

source: ** For example, `useFriendStatus` below is our first custom Hook:
ja: **例えば、以下の `useFriendStatus` が我々の最初のカスタムフックの例です：

source: There's nothing new inside of it -- the logic is copied from the components above.
ja: 新しいことは何もありません。ロジックは上記のコンポーネントからコピーしてきただけです。

source: Just like in a component, make sure to only call other Hooks unconditionally at the top level of your custom Hook.
ja: コンポーネントのときと同様に、他のフックを呼ぶときはカスタムフックのトップレベルで無条件に呼び出していることを確認してください。

source: Unlike a React component, a custom Hook doesn't need to have a specific signature.
ja: React のコンポーネントと違い、カスタムフックは特定のシグネチャを持つ必要はありません。

source: We can decide what it takes as arguments, and what, if anything, it should return.
ja: 何を引数として受け取り、そして（必要なら）何を返すのか、といったことは自分で決めることができます。

source: In other words, it's just like a normal function.
ja: 別の言い方をすると、普通の関数と同じだということです。

source: Its name should always start with `use` so that you can tell at a glance that the [rules of Hooks](/docs/hooks-rules.html) apply to it.
ja: 一目で[フックのルール](/docs/hooks-rules.html)が適用されるものだと分かるようにするために、名前は `use` で始めるべきです。

source: The purpose of our `useFriendStatus` Hook is to subscribe us to a friend's status.
ja: この `useFriendStatus` の目的はフレンドのステータスを購読するというものです。

source: This is why it takes `friendID` as an argument, and returns whether this friend is online:
ja: ですので `friendID` を引数として持ち、そのフレンドがオンラインかどうかを返します。

source: Now let's see how we can use our custom Hook.
ja: ではこのカスタムフックの使い方を見ていきましょう。

source: ## Using a Custom Hook {#using-a-custom-hook}
ja: ## カスタムフックを使う {#using-a-custom-hook}

source: In the beginning, our stated goal was to remove the duplicated logic from the `FriendStatus` and `FriendListItem` components.
ja: そもそもの我々の目的は `FriendStatus` と `FriendListItem` コンポーネントでの重複したロジックを取り除くことでした。

source: Both of them want to know whether a friend is online.
ja: どちらのコンポーネントもフレンドがオンラインかどうかを知りたいのです。

source: Now that we've extracted this logic to a `useFriendStatus` hook, we can *just use it:*
ja: 既にロジックを `useFriendStatus` フックへと抽出したので、それを*ただ単に使えばいい*のです：

source: **Is this code equivalent to the original examples?** Yes, it works in exactly the same way.
ja: **このコードは元のコードと同等？** はい、全く同じように動作します。

source: If you look closely, you'll notice we didn't make any changes to the behavior.
ja: 注意深く見れば、ふるまいに何の変更も加えていないということが分かります。

source: All we did was to extract some common code between two functions into a separate function.
ja: やったのは、共通のコードを別の関数に抽出したということだけです。

source: **Custom Hooks are a convention that naturally follows from the design of Hooks, rather than a React feature.**
ja: **カスタムフックは React の機能というよりは、フックの設計から自然と導かれる慣習のようなものです。**

source: **Do I have to name my custom Hooks starting with “`use`”?
ja: **カスタムフックは "`use`" という名前で始めるべき？

source: ** Please do.
ja: ** ぜひそうしてください。

source: This convention is very important.
ja: この規約はとても重要です。

source: Without it, we wouldn't be able to automatically check for violations of [rules of Hooks](/docs/hooks-rules.html) because we couldn't tell if a certain function contains calls to Hooks inside of it.
ja: この規約がなければ、ある関数が内部でフックを呼んでいるかどうかを知る方法がなくなり、[フックのルール](/docs/hooks-rules.html)の違反を自動でチェックすることができなくなります。

source: **Do two components using the same Hook share state?** No.
ja: **同じフックを使うコンポーネントは state を共有する？** いいえ。

source: Custom Hooks are a mechanism to reuse *stateful logic* (such as setting up a subscription and remembering the current value), but every time you use a custom Hook, all state and effects inside of it are fully isolated.
ja: カスタムフックは *state を使うロジック*（データの購読を登録したり現在の値を覚えておいたり）を共有するためのものですが、カスタムフックを使う場所ごとで、内部の state や副作用は完全に分離しています。

source: **How does a custom Hook get isolated state?** Each *call* to a Hook gets isolated state.
ja: **どのようにしてカスタムフックは独立したステートを得るのか？** それぞれのフックの*呼び出し*が独立した state を得ます。

source: Because we call `useFriendStatus` directly, from React's point of view our component just calls `useState` and `useEffect`.
ja: `useFriendStatus` を直接呼びだしていますので、React から見れば我々のコンポーネントが `useState` や `useEffect` を呼んだ場合と変わりません。

source: And as we [learned](/docs/hooks-state.html#tip-using-multiple-state-variables) [earlier](/docs/hooks-effect.html#tip-use-multiple-effects-to-separate-concerns), we can call `useState` and `useEffect` many times in one component, and they will be completely independent.
ja: すでに[ここ](/docs/hooks-state.html#tip-using-multiple-state-variables)や[ここ](/docs/hooks-effect.html#tip-use-multiple-effects-to-separate-concerns)で学んだ通り、`useState` や `useEffect` はひとつのコンポーネント内で複数回呼ぶことができ、それらは完全に独立しています。

source: ### Tip: Pass Information Between Hooks {#tip-pass-information-between-hooks}
ja: ### ヒント：フック間で情報を受け渡す {#tip-pass-information-between-hooks}

source: Since Hooks are functions, we can pass information between them.
ja: フックは関数ですので、フック間で情報を受け渡すことができます。

source: To illustrate this, we'll use another component from our hypothetical chat example.
ja: これを例示するため、我々のチャットの例で、別のコンポーネントを使うことにしましょう。

source: This is a chat message recipient picker that displays whether the currently selected friend is online:
ja: これはチャットの受信者を選ぶ画面であり、現在選択中のフレンドがオンラインかどうかを表示します。

source: We keep the currently chosen friend ID in the `recipientID` state variable, and update it if the user chooses a different friend in the `<select>` picker.
ja: 現在選択中のフレンド ID を `recipientID` という state 変数に保持し、`<select>` ピッカー内で別のフレンドが選択されるごとにそれを更新します。

source: Because the `useState` Hook call gives us the latest value of the `recipientID` state variable, we can pass it to our custom `useFriendStatus` Hook as an argument:
ja: `useState` フックは `recipientID` という state 変数の最新の値を返しますので、それを `useFriendStatus` カスタムフックに引数として渡すことができます。

source: This lets us know whether the *currently selected* friend is online.
ja: これにより*現在選択中の*フレンドがオンラインかどうかが分かります。

source: If we pick a different friend and update the `recipientID` state variable, our `useFriendStatus` Hook will unsubscribe from the previously selected friend, and subscribe to the status of the newly selected one.
ja: 別のフレンドを選択して `recipientID` 変数が更新された場合、`useFriendStatus` フックはこれまで選択されていたフレンドを購読解除して、新しく選択されたフレンドのステータスを購読開始します。

source: Custom Hooks offer the flexibility of sharing logic that wasn't possible in React components before.
ja: カスタムフックにより、これまでの React コンポーネントでは不可能であった、ロジック共有に関する柔軟性が得られます。

source: You can write custom Hooks that cover a wide range of use cases like form handling, animation, declarative subscriptions, timers, and probably many more we haven't considered.
ja: フォーム操作、アニメーション、宣言的データ購読、タイマー、さらには我々が思いついたことのない多様なユースケースに対するカスタムフックを記述することが可能です。

source: What's more, you can build Hooks that are just as easy to use as React's built-in features.
ja: 何より、作ったカスタムフックは React の組み込み機能と同じくらい簡単に使えるようになるのです。

source: Try to resist adding abstraction too early.
ja: あまり焦って抽象化を加えないようにしましょう。

source: Now that function components can do more, it's likely that the average function component in your codebase will become longer.
ja: 関数コンポーネントがやれることが増えたので、平均的な関数コンポーネントはこれまでより長いものになるでしょう。

source: This is normal -- don't feel like you *have to* immediately split it into Hooks.
ja: それは普通のことですので、いますぐカスタムフックに分割しないと*いけない*とは考えないでください。

source: But we also encourage you to start spotting cases where a custom Hook could hide complex logic behind a simple interface, or help untangle a messy component.
ja: 一方で、カスタムフックをどこで使えば複雑なロジックをシンプルなインターフェースに置き換えたり、ごちゃっとしたコンポーネントを整理したりできるのか、考え始めることをお勧めします。

source: For example, maybe you have a complex component that contains a lot of local state that is managed in an ad-hoc way.
ja: 一例として、その場しのぎで多くのローカル state が含まれるようになった複雑なコンポーネントをお持ちかもしれません。

source: `useState` doesn't make centralizing the update logic any easier so you might prefer to write it as a [Redux](https://redux.js.org/) reducer:
ja: `useState` を使っても更新ロジックの集中化が簡単になるわけではありませんので、それを [Redux](https://redux.js.org/) のリデューサ (reducer) で書きたくなることがあるでしょう：

source: Reducers are very convenient to test in isolation, and scale to express complex update logic.
ja: リデューサは単独でのテストが非常にやりやすく、複雑な更新ロジックを表現する場合でもスケールします。

source: You can further break them apart into smaller reducers if necessary.
ja: 必要に応じて後でより小さなリデューサに分割することも可能です。

source: However, you might also enjoy the benefits of using React local state, or might not want to install another library.
ja: しかし、React のローカル state による手軽さの方が好ましい場合もあるでしょうし、他のライブラリをインストールしたくない場合もあるでしょう。

source: So what if we could write a `useReducer` Hook that lets us manage the *local* state of our component with a reducer?
ja: そこで、`useReducer` というフックを書いて、コンポーネントの*ローカル* state をリデューサで管理できるとしたらどうでしょうか？

source: A simplified version of it might look like this:
ja: 簡略版では以下のようなものになるでしょう：

source: Now we could use it in our component, and let the reducer drive its state management:
ja: これをコンポーネント内で使うことができ、リデューサを活用してステート管理ができるようになります：

source: The need to manage local state with a reducer in a complex component is common enough that we've built the `useReducer` Hook right into React.
ja: ローカルステートをリデューサで管理したいという要求はとてもよくあるので、React にその機能を含めてあります。

source: You'll find it together with other built-in Hooks in the [Hooks API reference](/docs/hooks-reference.html).
ja: [フック API リファレンス](/docs/hooks-reference.html)で他の組み込みフックと共に解説しています。
